Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# AIModelEditor.CustomHeadersLabel
source: Custom headers:
de: Benutzerdefinierte Header:
ja: カスタムヘッダー:
pt_br: Cabeçalhos personalizados:
ru: Пользовательские заголовки:
zh_hans: 自定义头信息：

# AIModelEditor.EditTitle
source: Edit Manual AI Model
de: Manuelles KI-Modell bearbeiten
ja: 手動AIモデルを編集
pt_br: Editar modelo de IA manual
ru: Изменить ручную модель ИИ
zh_hans: 编辑手动 AI 模型

# AIModelEditor.FeatureFunctionCalling
source: Function calling
de: Funktionsaufrufe
ja: 関数呼び出し
pt_br: Chamada de funções
ru: Вызов функций
zh_hans: 函数调用

# AIModelEditor.FeatureHostedCodeInterpreter
source: Hosted code interpreter
de: Gehosteter Code-Interpreter
ja: ホスト型コードインタープリタ
pt_br: Interpretador de código hospedado
ru: Размещённый интерпретатор кода
zh_hans: 托管代码解释器

# AIModelEditor.FeatureHostedFileSearch
source: Hosted file search
de: Gehostete Dateisuche
ja: ホスト型ファイル検索
pt_br: Busca de arquivos hospedada
ru: Размещённый поиск по файлам
zh_hans: 托管文件搜索

# AIModelEditor.FeatureHostedWebSearch
source: Hosted web search
de: Gehostete Websuche
ja: ホスト型ウェブ検索
pt_br: Busca na web hospedada
ru: Размещённый веб-поиск
zh_hans: 托管网络搜索

# AIModelEditor.FeatureStreamingResponses
source: Streaming responses
de: Streaming-Antworten
ja: ストリーミング応答
pt_br: Respostas por streaming
ru: Потоковые ответы
zh_hans: 流式响应

# AIModelEditor.InvalidHeaderName
source: Custom header name “%@” is not valid. Use only RFC 7230 token characters (letters, digits, and any of !#$%%&'*+-.^_`|~).
de: Der benutzerdefinierte Header-Name „%@“ ist ungültig. Verwenden Sie nur RFC-7230-Token-Zeichen (Buchstaben, Ziffern und die Zeichen !#$%%&'*+-.^_`|~).
ja: カスタムヘッダー名「%@」は無効です。RFC 7230のトークン文字（英数字、および !#$%%&'*+-.^_`|~ のいずれか）のみを使用してください。
pt_br: O nome de cabeçalho personalizado “%@” não é válido. Use apenas caracteres de token do RFC 7230 (letras, dígitos e qualquer um de !#$%%&'*+-.^_`|~).
ru: Имя пользовательского заголовка «%@» недопустимо. Используйте только символы токена RFC 7230 (буквы, цифры и любые из !#$%%&'*+-.^_`|~).
zh_hans: 自定义标题“%@”无效。仅可使用RFC 7230令牌字符（字母、数字以及!#$%%&'*+-.^_`|~）。

# AIModelEditor.InvalidHeaderValue
source: The value for custom header “%@” must not contain newline or null characters.
de: Der Wert für den benutzerdefinierten Header „%@“ darf keine Zeilenumbruch- oder Null-Zeichen enthalten.
ja: カスタムヘッダー「%@」の値には、改行文字やヌル文字を含めることはできません。
pt_br: O valor do cabeçalho personalizado “%@” não pode conter caracteres de nova linha ou nulos.
ru: Значение пользовательского заголовка «%@» не должно содержать символы новой строки или null.
zh_hans: 自定义标题“%@”的值不得包含换行或空字符。

# AIModelEditor.InvalidModelTitle
source: Invalid Manual AI Model
de: Ungültiges manuelles KI-Modell
ja: 無効な手動AIモデル
pt_br: Modelo de IA manual inválido
ru: Недопустимая ручная модель ИИ
zh_hans: 无效的手动 AI 模型

# AIModelEditor.MaxResponseTokensLabel
source: Max response tokens:
de: Max. Antwort-Token:
ja: 最大応答トークン数:
pt_br: Máximo de tokens de resposta:
ru: Макс. токенов ответа:
zh_hans: 最大响应令牌数：

# AIModelEditor.MaxResponseTokensPositive
source: Max response tokens must be greater than zero.
de: Die maximale Anzahl an Antwort-Token muss größer als null sein.
ja: 最大応答トークン数は0より大きくする必要があります。
pt_br: O número máximo de tokens de resposta deve ser maior que zero.
ru: Максимальное количество токенов ответа должно быть больше нуля.
zh_hans: 最大响应令牌数必须大于 0。

# AIModelEditor.MissingInfoText
source: Enter a model name and URL before testing the connection.
de: Geben Sie einen Modellnamen und eine URL ein, bevor Sie die Verbindung testen.
ja: 接続をテストする前に、モデル名とURLを入力してください。
pt_br: Digite um nome de modelo e uma URL antes de testar a conexão.
ru: Прежде чем проверять подключение, введите имя модели и URL.
zh_hans: 请先输入模型名称和 URL，再测试连接。

# AIModelEditor.MissingInfoTitle
source: Missing Information
de: Fehlende Informationen
ja: 情報が不足しています
pt_br: Informações ausentes
ru: Отсутствует информация
zh_hans: 缺少信息

# AIModelEditor.ModelLabel
source: Model:
de: Modell:
ja: モデル:
pt_br: Modelo:
ru: Модель:
zh_hans: 模型：

# AIModelEditor.ModelRequired
source: Model is required.
de: Modell ist erforderlich.
ja: モデルは必須です。
pt_br: O modelo é obrigatório.
ru: Необходимо указать модель.
zh_hans: 必须提供模型名称。

# AIModelEditor.NamesUnique
source: Manual model names must be unique.
de: Namen manueller Modelle müssen eindeutig sein.
ja: 手動で追加したモデル名は重複できません。
pt_br: Os nomes de modelos manuais devem ser únicos.
ru: Имена моделей, добавленных вручную, должны быть уникальными.
zh_hans: 手动模型名称必须唯一。

# AIModelEditor.PresetCustom
source: Custom
de: Benutzerdefiniert
ja: カスタム
pt_br: Personalizado
ru: Пользовательский
zh_hans: 自定义

# AIModelEditor.PresetLabel
source: Preset:
de: Voreinstellung:
ja: プリセット:
pt_br: Predefinição:
ru: Предустановка:
zh_hans: 预设：

# AIModelEditor.SupportsTemperature
source: Supports temperature
de: Unterstützt Temperatur
ja: 温度パラメータに対応
pt_br: Suporta temperatura
ru: Поддерживает температуру
zh_hans: 支持温度参数

# AIModelEditor.SupportsTemperatureTooltip
source: Uncheck for models that reject a temperature parameter, such as Anthropic Opus 4.7 and later.
de: Deaktivieren Sie dies für Modelle, die einen Temperatur-Parameter ablehnen, wie Anthropic Opus 4.7 und neuer.
ja: Anthropic Opus 4.7以降など、温度パラメータを受け付けないモデルではチェックを外してください。
pt_br: Desmarque para modelos que rejeitam um parâmetro de temperatura, como o Anthropic Opus 4.7 e posteriores.
ru: Снимите флажок для моделей, которые не принимают параметр температуры, например Anthropic Opus 4.7 и более поздних версий.
zh_hans: 对于拒绝温度参数的模型（例如 Anthropic Opus 4.7 及更高版本），请取消选中。

# AIModelEditor.TestConnection
source: Test Connection
de: Verbindung testen
ja: 接続をテスト
pt_br: Testar conexão
ru: Проверить соединение
zh_hans: 测试连接

# AIModelEditor.Testing
source: Testing…
de: Wird getestet …
ja: テスト中…
pt_br: Testando…
ru: Проверка…
zh_hans: 正在测试…

# AIModelEditor.URLRequired
source: URL is required.
de: URL ist erforderlich.
ja: URLは必須です。
pt_br: A URL é obrigatória.
ru: Необходимо указать URL.
zh_hans: 必须提供 URL。

# AIModelEditor.ValueColumn
source: Value
de: Wert
ja: 値
pt_br: Valor
ru: Значение
zh_hans: 值

# AIModelEditor.VectorStoreDisabled
source: Disabled
de: Deaktiviert
ja: 無効
pt_br: Desativado
ru: Отключено
zh_hans: 已停用

# AIModelEditor.VectorStoreLabel
source: Vector store:
de: Vektorspeicher:
ja: ベクトルストア:
ru: Векторное хранилище:
zh_hans: 向量存储：

# AIPluginClient.CodeMissing
source: Plugin missing from app bundle or not readable
de: Plugin fehlt im App-Bundle oder ist nicht lesbar
ja: プラグインがアプリバンドルに存在しないか、読み取れません
pt_br: Plugin ausente do pacote do app ou ilegível
ru: Плагин отсутствует в пакете приложения или недоступен для чтения
zh_hans: 应用包中缺少插件或无法读取

# AIPluginClient.CodeNotUTF8
source: Plugin code not valid UTF-8
de: Plugin-Code ist kein gültiges UTF-8
ja: プラグインコードが有効なUTF-8ではありません
pt_br: Código do plugin não é UTF-8 válido
ru: Код плагина не является допустимым UTF-8
zh_hans: 插件代码不是有效的UTF-8格式

# AIPluginClient.InvalidVersionString
source: Invalid version string: %@
de: Ungültige Versionszeichenfolge: %@
ja: 無効なバージョン文字列: %@
pt_br: String de versão inválida: %@
ru: Недопустимая строка версии: %@
zh_hans: 无效版本字符串：%@

# AIPluginClient.NotAllowed
source: Plugin not allowed by administator.
de: Plugin ist durch den Administrator nicht zugelassen.
ja: 管理者によりプラグインが許可されていません。
pt_br: Plugin não permitido pelo administrador.
ru: Плагин запрещён администратором.
zh_hans: 管理员不允许该插件使用

# AIPluginClient.NotFound
source: Plugin not found
de: Plugin nicht gefunden
ja: プラグインが見つかりません
pt_br: Plugin não encontrado
ru: Плагин не найден
zh_hans: 找不到该插件

# AIPluginClient.SignatureInvalid
source: The plugin’s signature is invalid. Reinstall the plugin or upgrade iTerm2.
de: Die Signatur des Plugins ist ungültig. Installieren Sie das Plugin neu oder aktualisieren Sie iTerm2.
ja: プラグインの署名が無効です。プラグインを再インストールするか、iTerm2をアップグレードしてください。
pt_br: A assinatura do plugin é inválida. Reinstale o plugin ou atualize o iTerm2.
ru: Подпись плагина недействительна. Переустановите плагин или обновите iTerm2.
zh_hans: 插件的签名无效。请重新安装插件或升级iTerm2。

# AIPluginClient.SignatureMalformed
source: Signature of AI plugin is malformed
de: Die Signatur des KI-Plugins ist fehlerhaft
ja: AIプラグインの署名が不正な形式です
pt_br: A assinatura do plugin de IA está malformada
ru: Подпись плагина ИИ повреждена
zh_hans: AI插件的签名格式错误

# AIPluginClient.SignatureMissing
source: Signature missing from app bundle or not readable
de: Signatur fehlt im App-Bundle oder ist nicht lesbar
ja: 署名がアプリバンドルに存在しないか、読み取れません
pt_br: Assinatura ausente do pacote do app ou ilegível
ru: Подпись отсутствует в пакете приложения или недоступна для чтения
zh_hans: 应用包中缺少签名或无法读取

# AIPluginClient.UnexpectedException
source: Unexpected exception: %@
de: Unerwartete Ausnahme: %@
ja: 予期しない例外: %@
pt_br: Exceção inesperada: %@
ru: Непредвиденное исключение: %@
zh_hans: 意外的异常：%@

# AIPluginClient.VersionMismatch
source: Plugin has version %1$@ but iTerm2 expects %2$@. Upgrade one or both.
de: Das Plugin hat Version %1$@, aber iTerm2 erwartet %2$@. Aktualisieren Sie eines von beiden oder beide.
ja: プラグインのバージョンは%1$@ですが、iTerm2は%2$@を想定しています。どちらか、または両方をアップグレードしてください。
pt_br: O plugin tem a versão %1$@, mas o iTerm2 espera a %2$@. Atualize um ou ambos.
ru: Версия плагина %1$@, но iTerm2 ожидает %2$@. Обновите один из компонентов или оба.
zh_hans: 插件版本为%1$@，但iTerm2期望%2$@。请升级其中一个或两个。

# AIPluginClient.VersionUnknown
source: Unable to determine version of AI plugin. Reinstall it and upgrade iTerm2 if possible.
de: Die Version des KI-Plugins kann nicht ermittelt werden. Installieren Sie es neu und aktualisieren Sie nach Möglichkeit iTerm2.
ja: AIプラグインのバージョンを確認できません。可能であれば再インストールし、iTerm2をアップグレードしてください。
pt_br: Não foi possível determinar a versão do plugin de IA. Reinstale-o e atualize o iTerm2, se possível.
ru: Не удалось определить версию плагина ИИ. Переустановите его и, если возможно, обновите iTerm2.
zh_hans: 无法确定AI插件的版本。请重新安装并尽可能升级iTerm2。

# AISafetyCheck.EnablePromptBody
source: iTerm2 can use AI to check the safety of commands suggested by your AI agent. Would you like to enable safety checking? When enabled, each proposed command will be sent to your configured AI provider for a safety check.
de: iTerm2 kann KI verwenden, um die Sicherheit von Befehlen zu überprüfen, die von Ihrem KI-Agenten vorgeschlagen werden. Möchten Sie die Sicherheitsüberprüfung aktivieren? Wenn aktiviert, wird jeder vorgeschlagene Befehl zur Sicherheitsüberprüfung an Ihren konfigurierten KI-Anbieter gesendet.
ja: iTerm2は、AIエージェントが提案するコマンドの安全性をAIでチェックできます。安全性チェックを有効にしますか？ 有効にすると、提案された各コマンドが安全性チェックのために設定済みのAIプロバイダーに送信されます。
pt_br: O iTerm2 pode usar IA para verificar a segurança dos comandos sugeridos pelo seu agente de IA. Deseja ativar a verificação de segurança? Quando ativada, cada comando proposto será enviado ao provedor de IA configurado para uma verificação de segurança.
ru: iTerm2 может использовать ИИ для проверки безопасности команд, предложенных вашим ИИ-агентом. Включить проверку безопасности? При включении каждая предложенная команда будет отправляться настроенному поставщику ИИ для проверки безопасности.
zh_hans: iTerm2 可以使用 AI 检查你的 AI 智能体建议的命令是否安全。要启用安全检查吗？ 启用后，每条建议的命令都将发送给你配置的 AI 提供者进行安全检查。

# AISafetyCheck.EnablePromptHeading
source: Enable Command Safety Checking?
de: Befehlssicherheitsprüfung aktivieren?
ja: コマンドの安全性チェックを有効にしますか？
pt_br: Ativar verificação de segurança de comandos?
ru: Включить проверку безопасности команд?
zh_hans: 启用命令安全检查？

# AISafetyCheck.KeepAppleIntelligence
source: Keep Apple Intelligence
de: Apple Intelligence beibehalten
ja: Apple Intelligenceを使い続ける
pt_br: Manter o Apple Intelligence
ru: Оставить Apple Intelligence
zh_hans: 保留 Apple Intelligence

# AISafetyCheck.SwitchProviderBody
source: Until now, iTerm2 checked the safety of AI-suggested commands on your Mac using Apple Intelligence, at no cost. It can now use your configured AI model instead, which is more accurate but sends each checked command to your AI provider and may incur charges. Switch to your configured model? If you decline, iTerm2 keeps using Apple Intelligence.
de: Bisher hat iTerm2 die Sicherheit von KI-vorgeschlagenen Befehlen auf Ihrem Mac kostenlos mit Apple Intelligence überprüft. Es kann jetzt stattdessen Ihr konfiguriertes KI-Modell verwenden, das genauer ist, aber jeden geprüften Befehl an Ihren KI-Anbieter sendet und Kosten verursachen kann. Zu Ihrem konfigurierten Modell wechseln? Wenn Sie ablehnen, verwendet iTerm2 weiterhin Apple Intelligence.
ja: これまでiTerm2は、Apple Intelligenceを使ってMac上で無料でAI提案コマンドの安全性をチェックしていました。今後は設定済みのAIモデルを使用することもでき、精度は向上しますが、チェックする各コマンドが設定済みのAIプロバイダーに送信され、料金が発生する場合があります。 設定済みのモデルに切り替えますか？拒否した場合、iTerm2は引き続きApple Intelligenceを使用します。
pt_br: Até agora, o iTerm2 verificava a segurança dos comandos sugeridos por IA no seu Mac usando o Apple Intelligence, sem custo. Agora ele pode usar o modelo de IA configurado, que é mais preciso, mas envia cada comando verificado ao seu provedor de IA e pode gerar cobranças. Mudar para o modelo configurado? Se você recusar, o iTerm2 continuará usando o Apple Intelligence.
ru: До сих пор iTerm2 бесплатно проверял безопасность предложенных ИИ команд на вашем Mac с помощью Apple Intelligence. Теперь вместо этого можно использовать настроенную вами модель ИИ, которая точнее, но отправляет каждую проверяемую команду вашему поставщику ИИ и может повлечь расходы. Переключиться на настроенную модель? Если вы откажетесь, iTerm2 продолжит использовать Apple Intelligence.
zh_hans: 到目前为止，iTerm2 一直在你的 Mac 上使用 Apple Intelligence 免费检查 AI 建议命令的安全性。现在它可以改用你配置的 AI 模型，准确度更高，但会将每条被检查的命令发送给你的 AI 提供者，并可能产生费用。 要切换到你的模型吗？如果你拒绝，iTerm2 将继续使用 Apple Intelligence。

# AISafetyCheck.SwitchProviderHeading
source: Command Safety Checking Has Changed
de: Die Befehlssicherheitsprüfung hat sich geändert
ja: コマンドの安全性チェックが変更されました
pt_br: A verificação de segurança de comandos mudou
ru: Проверка безопасности команд изменилась
zh_hans: 命令安全检查已更改

# AISafetyCheck.SwitchToMyModel
source: Switch to My Model
de: Zu meinem Modell wechseln
ja: 自分のモデルに切り替える
pt_br: Mudar para meu modelo
ru: Переключиться на мою модель
zh_hans: 切换到我的模型

# AITerm.AddFileFailed
source: Adding file to vector store failed
de: Hinzufügen der Datei zum Vektorspeicher fehlgeschlagen
ja: ベクトルストアへのファイルの追加に失敗しました
pt_br: Falha ao adicionar o arquivo ao vector store
ru: Не удалось добавить файл в векторное хранилище
zh_hans: 将文件添加到向量存储失败

# AITerm.AppleIntelligenceError
source: Apple Intelligence error: %@
de: Apple Intelligence-Fehler: %@
ja: Apple Intelligenceエラー: %@
pt_br: Erro do Apple Intelligence: %@
ru: Ошибка Apple Intelligence: %@
zh_hans: Apple Intelligence错误：%@

# AITerm.AppleIntelligenceRequiresOS
source: Apple Intelligence requires macOS 26 or later.
de: Apple Intelligence erfordert macOS 26 oder neuer.
ja: Apple IntelligenceにはmacOS 26以降が必要です。
pt_br: O Apple Intelligence requer o macOS 26 ou posterior.
ru: Apple Intelligence требует macOS 26 или более поздней версии.
zh_hans: Apple Intelligence需要macOS 26或更高版本。

# AITerm.CouldNotDecode
source: Could not decode response:
de: Antwort konnte nicht decodiert werden:
ja: レスポンスをデコードできませんでした:
pt_br: Não foi possível decodificar a resposta:
ru: Не удалось декодировать ответ:
zh_hans: 无法解码响应：

# AITerm.EmptyResponse
source: Empty response from server
de: Leere Antwort vom Server
ja: サーバーからの応答が空です
pt_br: Resposta vazia do servidor
ru: Пустой ответ от сервера
zh_hans: 来自服务器的空响应

# AITerm.ErrorFromProvider
source: Error from %1$@: %2$@
de: Fehler von %1$@: %2$@
ja: %1$@からのエラー: %2$@
pt_br: Erro de %1$@: %2$@
ru: Ошибка от %1$@: %2$@
zh_hans: %1$@产生的错误：%2$@

# AITerm.FailedToDecode
source: Failed to decode API response: %1$@. Data is: %2$@
de: API-Antwort konnte nicht decodiert werden: %1$@. Daten: %2$@
ja: APIレスポンスのデコードに失敗しました: %1$@。データ: %2$@
pt_br: Falha ao decodificar a resposta da API: %1$@. Os dados são: %2$@
ru: Не удалось декодировать ответ API: %1$@. Данные: %2$@
zh_hans: 解码API响应失败：%1$@。数据为：%2$@

# AITerm.FileNotWellFormed
source: The file may not be well formed.
de: Die Datei ist möglicherweise nicht wohlgeformt.
ja: ファイルの形式が正しくない可能性があります。
pt_br: O arquivo pode não estar bem formado.
ru: Возможно, файл имеет неверный формат.
zh_hans: 文件可能格式不正确。

# AITerm.FileUploadUnsupported
source: File upload not supported with this LLM vendor
de: Datei-Upload wird von diesem LLM-Anbieter nicht unterstützt
ja: このLLMベンダーではファイルのアップロードはサポートされていません
pt_br: Envio de arquivos não é compatível com este fornecedor de LLM
ru: Загрузка файлов не поддерживается этим поставщиком LLM
zh_hans: 此LLM供应商不支持文件上传。

# AITerm.IngestError
source: An error occurred while ingesting files to vector storage
de: Beim Einlesen von Dateien in den Vektorspeicher ist ein Fehler aufgetreten
ja: ファイルをベクトルストレージに取り込む際にエラーが発生しました
pt_br: Ocorreu um erro ao processar os arquivos para o vector storage
ru: Произошла ошибка при добавлении файлов в векторное хранилище
zh_hans: 将文件导入向量存储时发生错误。

# AITerm.InvalidProviderURL
source: Invalid URL for AI provider of %@
de: Ungültige URL für den KI-Anbieter von %@
ja: %@のAIプロバイダーのURLが無効です
pt_br: URL inválida para o provedor de IA de %@
ru: Недопустимый URL для поставщика ИИ %@
zh_hans: %@的AI提供商的无效URL。

# AITerm.NoModelConfigured
source: No AI model configured in settings.
de: In den Einstellungen ist kein KI-Modell konfiguriert.
ja: 設定でAIモデルが構成されていません。
pt_br: Nenhum modelo de IA configurado nos ajustes.
ru: В настройках не задана модель ИИ.
zh_hans: 设置中未配置AI模型。

# AITerm.NoRegistration
source: Could not obtain a valid API key registration for this model’s provider.
de: Für den Anbieter dieses Modells konnte keine gültige API-Schlüsselregistrierung abgerufen werden.
ja: このモデルのプロバイダーの有効なAPIキー登録を取得できませんでした。
pt_br: Não foi possível obter um registro de chave de API válido para o provedor deste modelo.
ru: Не удалось получить действительную регистрацию API-ключа для поставщика этой модели.
zh_hans: 无法获取该模型的提供商的有效API密钥注册信息。

# AITerm.RequestFailed
source: **Request failed** %@
de: **Anfrage fehlgeschlagen** %@
ja: **リクエストに失敗しました** %@
pt_br: **Falha na solicitação** %@
ru: **Запрос не выполнен** %@
zh_hans: **请求失败** %@

# AITerm.ReviewPlaceholderResponse
source: This is a demonstration response from the iTerm2 AI assistant. iTerm2 is configured with a placeholder key for App Review, so no external AI service is contacted and no data leaves your Mac. To get real answers, set your AI provider’s API key in iTerm2 Settings > AI.
de: Dies ist eine Demonstrationsantwort des iTerm2-KI-Assistenten. iTerm2 ist für die App-Überprüfung mit einem Platzhalterschlüssel konfiguriert, sodass kein externer KI-Dienst kontaktiert wird und keine Daten Ihren Mac verlassen. Um echte Antworten zu erhalten, legen Sie den API-Schlüssel Ihres KI-Anbieters unter iTerm2-Einstellungen > KI fest.
ja: これはiTerm2 AIアシスタントによるデモ用の応答です。iTerm2はApp Review用にプレースホルダーのキーで構成されているため、外部のAIサービスには接続されず、データがMacの外に送信されることもありません。実際の回答を得るには、iTerm2の設定 > AIでAIプロバイダーのAPIキーを設定してください。
pt_br: Esta é uma resposta de demonstração do assistente de IA do iTerm2. O iTerm2 está configurado com uma chave de espaço reservado para a revisão da App Store, portanto nenhum serviço de IA externo é contatado e nenhum dado sai do seu Mac. Para obter respostas reais, defina a chave de API do seu provedor de IA em Ajustes do iTerm2 > IA.
ru: Это демонстрационный ответ ИИ-ассистента iTerm2. Для проверки в App Store в iTerm2 настроен временный ключ, поэтому обращения к внешней службе ИИ не происходит и никакие данные не покидают ваш Mac. Чтобы получать настоящие ответы, укажите API-ключ вашего поставщика ИИ в iTerm2 Настройки > ИИ.
zh_hans: 这是iTerm2 AI助手的演示响应。iTerm2配置了App Review的占位键，因此不会联系外部AI服务，也不会在您的Mac上传输数据。要获得真实答案，请在iTerm2设置中的AI部分输入您AI提供商的API密钥。

# AITerm.StreamingUnsupported
source: Streaming is not supported by this language model in iTerm2. You can disable streaming in Settings > General > AI.
de: Streaming wird von diesem Sprachmodell in iTerm2 nicht unterstützt. Sie können Streaming unter Einstellungen > Allgemein > KI deaktivieren.
ja: iTerm2ではこの言語モデルでのストリーミングはサポートされていません。設定 > 一般 > AIでストリーミングを無効にできます。
pt_br: O streaming não é compatível com este modelo de linguagem no iTerm2. Você pode desativar o streaming em Ajustes > Geral > IA.
ru: Эта языковая модель не поддерживает потоковую передачу в iTerm2. Вы можете отключить потоковую передачу в Настройки > Общие > ИИ.
zh_hans: 此语言模型在iTerm2中不支持流处理功能。您可以在设置中的通用选项下的AI部分禁用流处理。

# AITerm.UnexpectedEOF
source: Unexpected end of file from server
de: Unerwartetes Dateiende vom Server
ja: サーバーからの予期しないファイル終端です
pt_br: Fim de arquivo inesperado do servidor
ru: Неожиданный конец файла от сервера
zh_hans: 服务器文件结尾异常

# AITerm.VectorStoresUnsupported
source: Vector stores are not supported with this LLM vendor
de: Vektorspeicher werden von diesem LLM-Anbieter nicht unterstützt
ja: このLLMベンダーではベクトルストアはサポートされていません
pt_br: Os vector stores não são compatíveis com este fornecedor de LLM
ru: Векторные хранилища не поддерживаются этим поставщиком LLM
zh_hans: 该LLM供应商不支持向量存储功能。

# AITermControllerObjC.NotEnabled
source: AI features are not enabled or the API key is missing.
de: KI-Funktionen sind nicht aktiviert oder der API-Schlüssel fehlt.
ja: AI機能が有効になっていないか、APIキーが設定されていません。
pt_br: Os recursos de IA não estão ativados ou a chave de API está ausente.
ru: Функции ИИ не включены или отсутствует API-ключ.
zh_hans: AI功能未启用或缺少API密钥。

# AITermControllerObjC.Thinking
source: Thinking…
de: Denke nach…
ja: 考え中…
pt_br: Pensando…
ru: Думаю…
zh_hans: 思考中…

# AITermGatekeeper.FeatureUnavailable
source: Feature Unavailable
de: Funktion nicht verfügbar
ja: 機能を利用できません
pt_br: Recurso indisponível
ru: Функция недоступна
zh_hans: 功能不可用

# AITermGatekeeper.GenerativeAIDisabled
source: Generative AI features have been disabled. Check with your system administrator.
de: Generative KI-Funktionen wurden deaktiviert. Wenden Sie sich an Ihren Systemadministrator.
ja: 生成AI機能は無効になっています。システム管理者に確認してください。
pt_br: Os recursos de IA generativa foram desativados. Consulte o administrador do sistema.
ru: Функции генеративного ИИ отключены. Обратитесь к системному администратору.
zh_hans: 生成式 AI 功能已被禁用。请联系你的系统管理员。

# AITermGatekeeper.MustEnableAI
source: You must enable AI features in settings before you can use this feature.
de: Sie müssen KI-Funktionen in den Einstellungen aktivieren, bevor Sie diese Funktion verwenden können.
ja: この機能を使用するには、設定でAI機能を有効にする必要があります。
pt_br: Você precisa ativar os recursos de IA nos ajustes antes de usar este recurso.
ru: Прежде чем использовать эту функцию, включите функции ИИ в настройках.
zh_hans: 使用此功能前，你必须在设置中启用 AI 功能。

# AITermGatekeeper.MustInstallPlugin
source: You must install the AI plugin before you can use this feature.
de: Sie müssen das KI-Plugin installieren, bevor Sie diese Funktion verwenden können.
ja: この機能を使用するには、AIプラグインをインストールする必要があります。
pt_br: Você precisa instalar o plugin de IA antes de usar este recurso.
ru: Прежде чем использовать эту функцию, установите плагин ИИ.
zh_hans: 使用此功能前，你必须先安装 AI 插件。

# AITermGatekeeper.PluginMissing
source: Plugin Missing
de: Plugin fehlt
ja: プラグインが見つかりません
pt_br: Plugin ausente
ru: Плагин отсутствует
zh_hans: 缺少插件

# AITermGatekeeper.Reveal
source: Reveal
de: Anzeigen
ja: 表示
pt_br: Mostrar
ru: Показать
zh_hans: 显示

# AITermGatekeeper.RevealInSettings
source: Reveal in Settings
de: In den Einstellungen anzeigen
ja: 設定で表示
pt_br: Mostrar nos ajustes
ru: Показать в настройках
zh_hans: 在设置中显示

# Announcement.MoreActions
source: More Actions…
de: Weitere Aktionen…
ja: その他の操作…
pt_br: Mais ações…
ru: Другие действия…
zh_hans: 更多操作…

# Announcement.PressAnyKeyToDismiss
source: Press any key to dismiss this message.
de: Drücken Sie eine beliebige Taste, um diese Meldung zu schließen.
ja: 任意のキーを押すとこのメッセージを閉じます。
pt_br: Pressione qualquer tecla para dispensar esta mensagem.
ru: Нажмите любую клавишу, чтобы закрыть это сообщение.
zh_hans: 按任意键关闭此消息。

# Announcement.QuestionIcon
source: Question icon
de: Fragesymbol
ja: 疑問符アイコン
pt_br: Ícone de pergunta
ru: Значок вопроса
zh_hans: 问题图标
